kinton/nrf52_expirements/ble_app_uart_non_fs/main.c
typedef enum {
    empty,
    token_write_and_check,
    command_processing,
} work_mode;
work_mode current_work_mode = empty;

typedef enum {
    is_token_writed,
    ask_for_token,
} ble_command;
#define ble_command_len 2;

typedef enum {
    ok,
    bad,
    empty_cmd
} ble_command_answer;

/*#define USER_DATA_START 0xED000
#define USER_DATA_SIZE 0x7000
#define FDS_SIZE 0x3000
#define FST_START USER_DATA_START + 0x3000
#define FST_END USER_DATA_START + USER_DATA_SIZE*/
#define FST_START 0xe0000
#define FST_END 0xed000
/*#define FST_START 0x3e000
#define FST_END 0x3ffff*/

#define tokenstart FST_START

// fstorage zone
// 0xED000 -> 0xF4000;
void wait_for_flash_ready(nrf_fstorage_t const * p_fstorage)
{
    /* While fstorage is busy, sleep and wait for an event. */
    while (nrf_fstorage_is_busy(p_fstorage))
    {
        // power_manage();
        idle_state_handle();
    }
}

nrf_fstorage_t fstorage;

static void print_flash_info(nrf_fstorage_t * p_fstorage)
{
    NRF_LOG_INFO("========| flash info |========");
    NRF_LOG_INFO("erase unit: \t%d bytes",      p_fstorage->p_flash_info->erase_unit);
    NRF_LOG_INFO("program unit: \t%d bytes",    p_fstorage->p_flash_info->program_unit);
    NRF_LOG_INFO("==============================");
}

/**@brief   Helper function to obtain the last address on the last page of the on-chip flash that
 *          can be used to write user data.
 */
static uint32_t nrf5_flash_end_addr_get()
{
    uint32_t const bootloader_addr = BOOTLOADER_ADDRESS;
    uint32_t const page_sz         = NRF_FICR->CODEPAGESIZE;
    uint32_t const code_sz         = NRF_FICR->CODESIZE;

    return (bootloader_addr != 0xFFFFFFFF ?
            bootloader_addr : (code_sz * page_sz));
}




/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}



static void read_and_send(uint32_t from) {
            ret_code_t err_code;
            uint8_t    readed_data[mh_len];
            /*for (int i = 0; i < mh_len; i++) {
              readed_data[i] = 0x0;
            }*/
            // Read data.
            // uint32_t const len  = strtol(argv[2], NULL, 10);
            uint16_t length = sizeof(readed_data);
            err_code = nrf_fstorage_read(&fstorage, from, readed_data, length);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Readed: \"%s\"", readed_data);
            
            // length = sizeof(readed_data);

            err_code = ble_nus_data_send(&m_nus, readed_data, &length, m_conn_handle);
            APP_ERROR_CHECK(err_code);
}
static void write_from_handler(void) {
            ret_code_t err_code;
            // static char     m_hello_world[] = "hello world";
            static char msg_to_write[tokenlen];
            
            memset(msg_to_write, 0, sizeof msg_to_write);
            for (uint32_t i = 0; i < mh_len; i++)
            {
                msg_to_write[i] = message_handler[i];
                // if (i == 255) break;
            }

            err_code = nrf_fstorage_write(&fstorage, tokenstart, msg_to_write, sizeof(msg_to_write), NULL);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Writed");
}
static bool get_token_write_status(void) {
            ret_code_t err_code;
            uint8_t readed_data[tokenlen] = {0};

            err_code = nrf_fstorage_read(&fstorage, tokenstart, readed_data, tokenlen);
            APP_ERROR_CHECK(err_code);
            
            bool is_token = false;
            for (int i = 0; i < tokenlen; i++) {
                if (readed_data[i] != 0xff) {
                    is_token = true;
                    break;
                }
            }

            return is_token;
}
static void send_command_answer(ble_command_answer ca) {
            ret_code_t err_code;
            uint16_t length = 1;
            uint8_t data_to_send[length];
            memset(data_to_send, ca, sizeof(data_to_send));
            err_code = ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
            APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        current_work_mode = command_processing;

        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        
        NRF_LOG_HEXDUMP_INFO(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        
        // if (p_evt->params.rx_data.p_data[0] == 113) { // == q, 71 in hex
        //     get_and_send_token();
        // }

        NRF_LOG_INFO("rx_data_len: %d", p_evt->params.rx_data.length);
        
